ptudor/navlistener-software/esp32/sdkconfig.defaults.s3
# navfeeder-esp defaults for the custom GNSS color observer (ESP32-S3).
#
# CMake and the build wrapper load this AFTER sdkconfig.defaults. Production
# and update-test profiles add their security settings after both files.
#
# Board: ESP32-S3-WROOM-1U-N16R8. Receiver UART on GPIO4/GPIO5, shared I2C on
# GPIO6/GPIO7, 24AA025E64 manifest EEPROM at 0x50, BOOT/DOWNLOAD on GPIO0, and
# the TLC5916 status panel in place of the Waveshare LCD/WS2812.

CONFIG_IDF_TARGET="esp32s3"

# The module carries 16 MB of flash, so this build uses its own partition table
# rather than the retired 4 MB development layout. See partitions-s3.csv for what the extra
# flash buys: 4 MiB application slots, a 3.25 MiB spool reservation, a 512 KiB
# diagnostic journal and 128 KiB of update state. The spool partition is still
# unmounted on both boards.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions-s3.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x10000

# GPIO4/GPIO5 receiver UART, GPIO6/GPIO7 manifest bus, and the Waveshare
# LCD/WS2812 drivers held dormant because their fixed pins are this board's I2C.
CONFIG_NVF_BOARD_GNSS_COLOR_NEO=y

# First-boot provisioning uses ESP-IDF's BLE manager with NimBLE and
# protocomm Security 2 (SRP6a authentication/key exchange + AES-GCM). Security
# 0 and 1 are omitted from the S3 image so a client cannot negotiate a weaker
# provisioning protocol. The protected SoftAP browser portal runs alongside it.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_0=n
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=n
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_2=y
CONFIG_WIFI_PROV_BLE_SEC_CONN=y

# Hardware edge timestamps must remain serviceable during NVS/OTA flash writes.
CONFIG_MCPWM_ISR_CACHE_SAFE=y

# N16R8 has 8 MiB octal PSRAM. Normal allocations and task stacks stay in
# internal RAM; the spool explicitly requests external memory. Missing PSRAM
# remains bootable using the smaller internal spool budget.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_NVF_SPOOL_PSRAM=y

# NVF_MANIFEST_FACTORY_INIT is deliberately absent: programming a blank manifest
# EEPROM is a manufacturing step, enabled explicitly for that one build.

# WireGuard (NVF_WIREGUARD): handshake crypto (X25519, BLAKE2s) runs on the lwIP tcpip
# task when a peer packet arrives, on top of the ordinary UDP receive path. Give it
# headroom over the 3 KiB default.
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=6144
